In [1]:
import pandas as pd
import os

<font color = green >

# Titanic Classification

</font>

<font color = green >

## Data fields

### train.csv & test.csv

</font>

* passengerId - id of passenger
* survival - survival
<br>- 0 = No, 1 = Yes
* pclass - Ticket class
<br>- 1 = 1st, 2 = 2nd, 3 = 3rd
* sex - Sex
* Age - Age in years
* sibsp - of siblings / spouses aboard the Titanic
* parch - of parents / children aboard the Titanic
* ticket - Ticket number
* fare - Passenger fare
* cabin - Cabin number
* embarked - Port of Embarkation
<br>- C = Cherbourg, Q = Queenstown, S = Southampton

<font color = green >

### Load train dataset 

</font>

In [2]:
cwd = os.getcwd()
path = os.path.join(cwd, 'data')

In [3]:
def get_train_set():
    fp = os.path.join(path, 'train.csv')
    df_train = pd.read_csv(fp, encoding='ISO-8859-1', low_memory=False)
    return df_train

df_train = get_train_set()
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<font color = green >

### Load test dataset 

</font>

In [4]:
def get_test_set():
    fp = os.path.join(path, 'test.csv')
    df_test = pd.read_csv(fp)
    return df_test

df_test = get_test_set()
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

<font color = green >

## Data Processing

</font>

In [5]:
# transform 'sex' values to integer (male: 0, female: 1)
def transform_sex_values(df):
    if df['Sex'].dtype == 'object':
        df['Sex'] = df['Sex'].apply(lambda value: 0 if value == 'male' else 1)
        return df
    else:
        return df

In [6]:
features = ['Pclass', 'Sex', 'SibSp', 'Parch']
X_train = df_train[features]
y_train = df_train['Survived']
X_test = df_test[features]

In [7]:
X_train = transform_sex_values(X_train)
X_test = transform_sex_values(X_test)

<ipython-input-5-477faeeff12f>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Sex'] = df['Sex'].apply(lambda value: 0 if value == 'male' else 1)

<font color = green >

### use MLPClassifier

</font>

In [8]:
from sklearn.neural_network import MLPClassifier

In [9]:
clf = MLPClassifier(hidden_layer_sizes=[50], alpha=1)
clf.fit(X_train, y_train)
print('train accuracy: ', clf.score(X_train, y_train))

train accuracy:  0.8058361391694725

/home/taras/Стільниця/projects/data-science/p38_env/lib/python3.8/site-packages/sklearn/neural_network/_multilayer_perceptron.py:614: ConvergenceWarning: Stochastic Optimizer: Maximum iterations (200) reached and the optimization hasn't converged yet.
  warnings.warn(

In [10]:
predictions = clf.predict(X_test)

In [11]:
output = pd.DataFrame({'PassengerId': df_test['PassengerId'], 'Survived': predictions})
output.to_csv('my_submission.csv', index=False)